duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/nb/nb.c
	#ifdef NB_DEBUG
		LOGD("%s", strbuf);
	#endif

		ptr = strstr(strbuf, "+CEREG: ");
		if(ptr)
		{
			//指令�
			ptr += strlen("+CEREG: ");
			//reg_status
			GetStringInforBySepa(ptr, ",", 2, tmpbuf);
			reg_status = atoi(tmpbuf);
		#ifdef NB_DEBUG
			LOGD("reg_status:%d", reg_status);
		#endif
			
			if(reg_status == 1 || reg_status == 5)
			{
				g_nw_registered = true;
			}
			else
			{
				g_nw_registered = false;
				nb_connected = false;
				
				if(k_timer_remaining_get(&nb_reconnect_timer) == 0)
					k_timer_start(&nb_reconnect_timer, K_SECONDS(10), K_NO_WAIT);
			}
		}
	}

	//if(at_cmd_write("AT+CSCON?", strbuf, sizeof(strbuf), NULL) == 0)
	if(nrf_modem_at_cmd(strbuf, sizeof(strbuf), "AT+CSCON?") == 0)
	{
		//+CSCON: <n>,<mode>[,<state>[,<access]]
		//<n>
		//0 �Unsolicited indications disabled
		//1 �Enabled: <mode>
		//2 �Enabled: <mode>[,<state>]
		//3 �Enabled: <mode>[,<state>[,<access>]]
		//<mode>
		//0 �Idle
		//1 �Connected
		//<state>
		//7 �E-UTRAN connected
		//<access>
		//4 �Radio access of type E-UTRAN FDD
	#ifdef NB_DEBUG
		LOGD("%s", strbuf);
	#endif
		ptr = strstr(strbuf, "+CSCON: ");
		if(ptr)
		{
			uint8_t mode;
			uint16_t len;

			len = strlen(strbuf);
			strbuf[len-2] = ',';
			strbuf[len-1] = 0x00;
			
			ptr += strlen("+CSCON: ");
			GetStringInforBySepa(ptr,",",2,tmpbuf);
			mode = atoi(tmpbuf);
		#ifdef NB_DEBUG
			LOGD("mode:%d", mode);
		#endif
			if(mode == 1)//connected
			{
				flag = true;	
			}
			else if(mode == 0)//idle
			{
			#ifdef NB_DEBUG
				LOGD("reg stat:%d", g_nw_registered);
			#endif
				if(g_nw_registered) 			//registered
				{
					flag = false;				//don't show no signal when ue is psm idle mode in registered, 
				}
				else							//not registered
				{
					flag = true;	
				}
			}
		}
	}

	if(g_rsrp > 97)
	{
		if(flag)
			g_nb_sig = NB_SIG_LEVEL_NO;
	}
	else if(g_rsrp >= 80)
	{
		g_nb_sig = NB_SIG_LEVEL_4;
	}
	else if(g_rsrp >= 60)
	{
		g_nb_sig = NB_SIG_LEVEL_3;
	}
	else if(g_rsrp >= 40)
	{
		g_nb_sig = NB_SIG_LEVEL_2;
	}
	else if(g_rsrp >= 20)
	{
		g_nb_sig = NB_SIG_LEVEL_1;
	}
	else
	{
		g_nb_sig = NB_SIG_LEVEL_0;
	}

	if(screen_id == SCREEN_ID_IDLE)
	{
		scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_SIG;
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}
}

void GetStringInforBySepa(uint8_t *sour_buf, uint8_t *key_buf, uint8_t pos_index, uint8_t *outbuf)
{
	uint8_t *ptr1,*ptr2;
	uint8_t count=0;
	
	if(sour_buf == NULL || key_buf == NULL || outbuf == NULL || pos_index < 1)
		return;

	ptr1 = sour_buf;
	while(1)
	{
		ptr2 = strstr(ptr1, key_buf);
		if(ptr2)
		{
			count++;
			if(count == pos_index)
			{
				memcpy(outbuf, ptr1, (ptr2-ptr1));
				return;
			}
			else
			{
				ptr1 = ptr2+1;
			}
		}
		else
		{
			return;
		}
	}
}

void GetModemDateTime(void)
{
	char *ptr;
	uint8_t timebuf[128] = {0};
	uint8_t tmpbuf[10] = {0};
	uint8_t tz_dir[3] = {0};
	uint8_t tz_count,daylight;
	static uint8_t retry = 5;

	//if(at_cmd_write("AT%CCLK?", timebuf, sizeof(timebuf), NULL) != 0)
	if(nrf_modem_at_cmd(timebuf,sizeof(timebuf),"AT%CCLK?") != 0)
	{
	#ifdef NB_DEBUG
		LOGD("Get CCLK fail!");
	#endif

	#ifndef NB_SIGNAL_TEST
		if(nb_connected && (retry > 0))
		{
			retry--;
			k_timer_start(&get_nw_time_timer, K_MSEC(1000), K_NO_WAIT);
		}
	#endif
		return;
	}

	retry = 5;
	
#ifdef NB_DEBUG	
	LOGD("%s", timebuf);
#endif
	//%CCLK: "21/02/26,08:31:33+32",0
	ptr = strstr(timebuf, "\"");
	if(ptr)
	{
		ptr++;
		memcpy(tmpbuf, ptr, 2);
		date_time.year = 2000+atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		date_time.month= atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		date_time.day = atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		date_time.hour = atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		date_time.minute = atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		date_time.second = atoi(tmpbuf);

		ptr+=2;
		memcpy(tz_dir, ptr, 1);
	
		ptr+=1;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);

		tz_count = atoi(tmpbuf);
		if(tz_dir[0] == '+')
		{
			TimeIncrease(&date_time, tz_count*15);
		}
		else if(tz_dir[0] == '-')
		{
			TimeDecrease(&date_time, tz_count*15);
		}

		ptr+=3;
		ptr = strstr(ptr, ",");
		if(ptr)
		{
			ptr+=1;
			memset(tmpbuf, 0, sizeof(tmpbuf));
			memcpy(tmpbuf, ptr, 1);
			daylight = atoi(tmpbuf);
			TimeDecrease(&date_time, daylight*60);
		}

		strcpy(g_timezone, tz_dir);
		sprintf(tmpbuf, "%d", tz_count/4);
		strcat(g_timezone, tmpbuf);
	}
#ifdef NB_DEBUG	
	LOGD("real time:%04d/%02d/%02d,%02d:%02d:%02d,%02d", 
					date_time.year,date_time.month,date_time.day,
					date_time.hour,date_time.minute,date_time.second,
					date_time.week);
#endif
	RedrawSystemTime();
	SaveSystemDateTime();
}

static void MqttSendData(uint8_t *data, uint32_t datalen)
{
	int ret;

	ret = add_data_into_send_cache(data, datalen);
#ifdef NB_DEBUG
	LOGD("data add ret:%d", ret);
#endif
	if(mqtt_connected)
	{
	#ifdef NB_DEBUG
		LOGD("begin 001");
	#endif
		NbSendDataStart();
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("begin 002");
	#endif
		if(nb_connected)
		{
		#ifdef NB_DEBUG
			LOGD("begin 003");
		#endif
			if(!mqtt_connecting_flag)
			{
			#ifdef NB_DEBUG
				LOGD("begin 003.1");
			#endif
				k_delayed_work_submit_to_queue(app_work_q, &mqtt_link_work, K_NO_WAIT);
			}
			else
			{
			#ifdef NB_DEBUG
				LOGD("begin 003.2");
			#endif
			}
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("begin 004", __func__);
		#endif
			if(k_timer_remaining_get(&nb_reconnect_timer) > 0)
				k_timer_stop(&nb_reconnect_timer);

			k_timer_start(&nb_reconnect_timer, K_SECONDS(10), K_NO_WAIT);
		}
	}
}

void NBSendSettingReply(uint8_t *data, uint32_t datalen)
{
	uint8_t buf[256] = {0};
	uint8_t tmpbuf[32] = {0};

	strcpy(buf, "{1:1:0:0:");
	strcat(buf, g_imei);
	strcat(buf, ":");
	strcat(buf, data);
	strcat(buf, ":");
	GetSystemTimeSecString(tmpbuf);
	strcat(buf, tmpbuf);	
	strcat(buf, "}");
#ifdef NB_DEBUG
	LOGD("eply data:%s", buf);
#endif
	MqttSendData(buf, strlen(buf));
}

void NBSendSosWifiData(uint8_t *data, uint32_t datalen)
{
	uint8_t buf[256] = {0};
	
